[
    {
      "Name": "C",
      "Author" : "Dennis Ritchie",
      "History": "Published: 1978,It was created in the 1970s by Dennis Ritchie",
      "About": "In 1978, Brian Kernighan and Dennis Ritchie published the first edition of The C Programming Language."
               
      
    },
    {
      "Name": "C++",
      "Author" : "Bjarne Stroustrup",
      "History": "Published: 1985,1985: The first official reference guide for the C++ programming language is published.",
      "About": "C++ is a cross-platform language that can be used to create high-performance applications."
      
    },
    {
      "Name": "Python",
      "Author" : "Guido Von Rossum",
      "History": "Published: 1991: Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected.",
      "About": "It supports multiple programming paradigms, including structured, object-oriented and functional programming.",
    },
    {
      "Name": "Lisp",
      "Author" : "John McCarthy",
      "History": "Lisp was originally created as a practical mathematical notation for computer programs, influenced by (though not originally derived from) the notation of Alonzo Church's lambda calculus. It quickly became the favored programming language for artificial intelligence (AI) research.",
      "About": "Lisp, an acronym for list processing, is a functional programming language that was designed for easy manipulation of data strings. As one of the oldest programming languages still in use, Lisp offers several different dialects and has influenced the development of other languages.",
    },
    {
      "Name": "Go",
      "Author" : "JoCVn McCarthy",
      "History": "It has gained popularity among many IT companies from last years",
      "About": "Among data scientists it is famous due to its performnace and agility",
    },
    {
      "Name": "Brainfuck",
      "Author" : "Urban Müller",
      "History": "It has cult following",
      "About": "Notable for its extreme minimalism, the language consists of only eight simple commands",
    },
    
   {
      "Name": "Java",
      "Author" : "James Gosling",
      "History": "Java was created at Sun Microsystems, Inc., where James Gosling led a team of researchers in an effort to create a new language that would allow consumer electronic devices to communicate with each other. ",
      "About": "Java is a programming language and computing platform first released by Sun Microsystems in 1995.",
    }
  ]  
